{
  "biography": "<style type=\"text/css\">\n    #custom-wrapper {\n        padding: 1rem;\n    }\n\n    #custom-wrapper > article > header {\n        font-size: 1.8rem;\n    }\n\n    #custom-wrapper > article > section {\n        font-size: 1.2rem;\n        max-width: 800px;\n    }\n\n    #custom-wrapper > article > section > div {\n        /*padding: 0.5rem;*/\n    }\n\n    @media (max-width: 420px) {\n        #custom-wrapper {\n            padding: 0.3rem;\n        }\n    }\n</style>\n\n<div id=\"custom-wrapper\">\n    <article>\n        <header><h1>What do I have to offer?</h1></header>\n        <section>\n            <div>\n                My 8 years of experience in engineering will present interest for you.\n                My work in different projects helped me gain knowledge of creation and supporting products such as:\n            </div>\n            <div>\n                <ul>\n                    <li>Portfolio Applications.</li>\n                    <li>Automotive Enterprise Applications.</li>\n                    <li>Commercial E-Commerce Applications.</li>\n                    <li>Business Pages Web Applications.</li>\n                    <li>Company Internal Applications.</li>\n                </ul>\n            </div>\n            <div>\n                I have experience in tools such as Angular, React, NodeJS, C# with .Net Core,\n                TypeScript, PHP, Laravel, Symfony and Docker.\n            </div>\n            <div>\n                I also have practice in implementing domain knowledge as a ruler for applications.\n            </div>\n            <div>\n                I build good team relationships and always strive to write clean,\n                easy-readable and understandable code.\n            </div>\n            <div>\n                I believe I could be an asset to your business, by helping it grow faster,\n                stay stronger and dominate in the market.\n            </div>\n        </section>\n    </article>\n    <article>\n        <header><h1>Introduction</h1></header>\n        <section>\n            <div>\n                First, let me start off by introducing myself! My name is Evgeniy and I am a software engineer.\n            </div>\n            <div>\n                I am currently employed by Cox Automotive Company.\n                The entire atmosphere and engineering team is awesome!\n            </div>\n            <div>\n                We are constantly sharing ideas and information through presentations and white board sessions,\n                that overall so much experience and knowledge is always being exchanged.\n                We also follow Agile at the workplace.\n            </div>\n        </section>\n    </article>\n    <article>\n        <header><h1>History</h1></header>\n        <section>\n            <div>I have always dreamed about being a software engineer, ever since I was a child.</div>\n            <div>\n                My first PC was a <a href=\"https://en.wikipedia.org/wiki/ZX_Spectrum\" target=\"_blank\">ZX Spectrum</a>\n                with 16KB RAM and I wrote my first program on it when I was 7 years old.\n                It was a simple loop counter displaying output into the TV.\n            </div>\n            <div>\n                Then in the College I build my first PC with custom hardware; it was IBM 386 with Windows 3.1.\n            </div>\n            <div>\n                After many years of working on gaining more knowledge and experience, my dreams so to speak, came true.\n            </div>\n        </section>\n    </article>\n    <article>\n        <header><h1>Never stop learning</h1></header>\n        <section>\n            <div>\n                I spend almost all of my free time on self-education.\n            </div>\n            <div>\n                Time is very valuable and important to me; therefore,\n                I try to invest any free time in trying to learn something new related to programming.\n            </div>\n            <div>\n                I sometimes will go for a morning jog before work.\n                When I do, I usually am listening to something in my headphones about programming.\n            </div>\n            <div>\n                Funny thing I learned recently is apparently Bill Gates does the same.\n            </div>\n            <div>\n                When I take my lunch break, I will usually go to my local public library where\n                I spend time practicing and learning new technologies. I use this time to also work on my side projects.\n            </div>\n            <div>\n                At the end of the day, I always try to reflect on the day and ask myself\n                if I learned something new today. If I answer yes, I know the day was not spent wasted.\n            </div>\n        </section>\n    </article>\n    <article>\n        <header><h1>What is something I find challenging?</h1></header>\n        <section>\n            <div>Naming. It is always hard for me to come up with short and self-explaining names.</div>\n            <div>\n                I also find it challenging to understand codes\n                that were irrationally written in a complicated manner.\n            </div>\n        </section>\n    </article>\n    <article>\n        <header><h1>What do I like most in programming?</h1></header>\n        <section>\n            <div>\n                Clean and self-documented code. A clean code is like calming music to my ears.\n                It does not distract me from pulling away my full attention and allows me\n                to continue to focus on my part of the job with the code.\n            </div>\n            <div>\n                A dirty code does the complete opposite.\n                It is messy and will need all of your time and attention because of it.\n            </div>\n        </section>\n    </article>\n    <article>\n        <header><h1>What are some things I dislike in programming?</h1></header>\n        <section>\n            <div>Code smell.</div>\n            <div>Unnecessary complicated code.</div>\n            <div>Commented code.</div>\n            <div>Short variable names (in big blocks of code)</div>\n            <div>Multiple level nested if/else statements.</div>\n        </section>\n    </article>\n    <article>\n        <header><h1>Where do I see myself in the future?</h1></header>\n        <section>\n            <div>I would like continue programming because this is what I love to do.</div>\n            <div>I will definitely continue to learn new tools and techniques. There are no limits to that.</div>\n        </section>\n    </article>\n</div>\n"
}